{
  "region": "England",
  "basics": {
    "climate": {
      "frost": "Average last frost late March–mid April (south earlier, north later). First autumn frosts often October–November.",
      "notes": [
        "Longer growing season than Scotland – sowing and planting can start 2–4 weeks earlier.",
        "Milder winters in the south allow overwintering of broad beans, garlic, onions.",
        "High risk of potato and tomato blight in warm, wet summers – rotate and ventilate."
      ]
    },
    "containers": {
      "pots": "Minimum depth 20–30cm for roots, 10L+ for fruiting crops (tomato, pepper).",
      "bags": "40L+ bags for potatoes, carrots, parsnips.",
      "raisedBeds": "Depth 30–45cm recommended; improves drainage on clay soils.",
      "directSoil": "Best for long roots (carrot, parsnip) and large crops (sweetcorn, squash)."
    },
    "protection": {
      "netting": [
        "Fine mesh against carrot fly, cabbage root fly, pea moth.",
        "Bird netting (2cm mesh) against pigeons on brassicas and soft fruit."
      ],
      "cloches": [
        "Plastic or fleece cloches extend sowing season.",
        "Useful for carrots, lettuce, beetroot in spring to warm soil."
      ],
      "coldFrames": [
        "Used to harden off seedlings from greenhouse to outside.",
        "Protects salads and herbs in winter."
      ],
      "greenhouses": [
        "Ideal for tomatoes, cucumbers, aubergines, peppers.",
        "Ventilate to avoid fungal diseases; shade in heat."
      ]
    },
    "spacingAndDepth": {
      "general": "Follow seed packet depth; usually 2–3x seed size. Thin to avoid overcrowding.",
      "leafy": "Sow 1–2cm deep, thin to 15–25cm apart.",
      "roots": "Carrots 0.5cm deep, 3–5cm apart. Beetroot 2cm deep, 10cm apart.",
      "legumes": "Beans/peas 5cm deep, 15–20cm apart in double rows.",
      "fruiting": "Tomatoes 0.5cm deep indoors, plant out 40–50cm apart.",
      "alliums": "Onion sets 2–3cm deep, 10cm apart. Garlic 5cm deep, 15cm apart.",
      "herbs": "Lightly cover fine seeds (basil, thyme); plant woody herbs (rosemary, sage) 30–60cm apart."
    },
    "care": {
      "watering": [
        "Water regularly in dry spells – especially pots and raised beds.",
        "Avoid wetting leaves at night to reduce fungal disease risk."
      ],
      "feeding": [
        "Leafy crops: high-nitrogen feeds (nettle tea).",
        "Fruit crops: high-potash feeds (tomato feed, comfrey tea).",
        "Roots: avoid overfeeding nitrogen – leads to leafy growth."
      ],
      "mulching": [
        "Use compost, grass clippings, straw to retain moisture.",
        "Suppress weeds and feed soil."
      ]
    },
    "pestsGeneral": {
      "slugsSnails": "Active especially spring–autumn; use beer traps, hand pick, copper tape.",
      "aphids": "Spray with soapy water, encourage ladybirds.",
      "pigeons": "Net brassicas, peas, seedlings.",
      "carrotFly": "Use mesh/fleece, sow resistant varieties, avoid thinning in daytime.",
      "whitefly": "Ventilate greenhouses, use sticky traps."
    },
    "glossary": {
      "cloche": "Portable cover (plastic, glass, fleece) to protect young plants.",
      "coldFrame": "Low box with transparent lid for hardening seedlings.",
      "mulch": "Organic matter spread on soil to conserve moisture and suppress weeds.",
      "earthingUp": "Pulling soil around base of plants (potatoes, leeks) to blanch stems or protect tubers.",
      "successionSowing": "Sowing small batches at intervals to extend harvest period."
    }
  }
}