{
  "region": "Ireland",
  "category": "basics",
  "climate_note": "Ireland has a mild, maritime climate: long, cool springs; frequent rain; fewer summer heat spikes than England; strong, wet westerlies in the west. Prioritise drainage, airflow and slug management.",
  "getting_started": {
    "containers": [
      "Start with what you have: food‑grade buckets, sturdy totes, timber crates (lined), or fabric grow bags.",
      "Drill 8–12 drainage holes (8–10mm) in rigid containers; raise on bricks/battens to prevent waterlogging.",
      "Add a drainage layer only if pots are very tall: 2–3cm coarse bark or chunky gravel; otherwise rely on good compost."
    ],
    "growing_media": [
      "Best mix for containers: 50% peat‑free multi‑purpose + 30% composted bark/wood‑fibre + 20% finished garden/green‑waste compost.",
      "For heavy rain areas, add 10–15% horticultural grit or perlite for airflow.",
      "Refresh the top 5–8cm each new season; fully replace tired mix for hungry crops (tomatoes, potatoes)."
    ],
    "fertility": [
      "Slow release base: well‑rotted compost or worm castings (5–10% by volume).",
      "Liquid feeds: seaweed extract (overall health), comfrey tea (high potash for fruiting), nettle tea (nitrogen for leafy growth).",
      "Top‑dress long‑season pots mid‑summer with 1–2cm worm castings."
    ]
  },
  "layout_sun_wind": {
    "sun": [
      "Full sun = 6+ hours direct; part shade = 3–5 hours. Herbs and leafy greens tolerate part shade well.",
      "Use reflective backdrops (pale walls) and bright surfaces to bounce light into yards/balconies."
    ],
    "wind_rain": [
      "Shelter from prevailing south‑westerlies with mesh screens or a run of tall pots/trellis.",
      "Tilt saucers after downpours to avoid standing water; check pots aren’t waterlogged after storms."
    ]
  },
  "watering": {
    "rules": [
      "Water deeply but less often; aim for moisture like a wrung‑out sponge 5–8cm down.",
      "Morning is best; avoid wetting foliage at night to reduce moulds in cool, damp weather.",
      "Mulch pots with 2–3cm straw/bark to reduce splash and slugs."
    ],
    "water_saving": [
      "Use butts on downpipes; store overflow in lidded tubs.",
      "Group thirsty crops (tomatoes, cucumbers) near the tap; drought‑tolerant herbs on edges."
    ]
  },
  "protection": {
    "netting_fleece_cloches": [
      "Insect mesh (0.8mm) over brassicas & carrots (flea beetle, cabbage white, carrot fly).",
      "Fleece in spring/autumn cold snaps; vent on mild days to avoid damp build‑up.",
      "Hoops: 20mm MDPE pipe over rebar; clip mesh/fleece; anchor with bricks or sandbags in strong winds."
    ],
    "cold_frames_greenhouse": [
      "Cold frames extend shoulder seasons; prop lid for airflow in damp spells.",
      "Mini‑polytunnel or plastic greenhouse: anchor well; open daily in humid weather to limit mildew/grey mould."
    ]
  },
  "supports": [
    "Cane teepees for peas/beans (bind with twine or cable ties).",
    "String training for tomatoes/cucumbers; secure top lines firmly in windy sites.",
    "Low corrals (short canes + twine) keep leafy pots upright during storms."
  ],
  "slug_snail_strategy": [
    "Physical: copper tape on pot rims; coarse grit rings; hand pick at dusk; beer traps refreshed every 2–3 days.",
    "Habitat: clear dense weeds and pot‑saucers where slugs hide; encourage frogs, ground beetles, birds.",
    "Barriers: wool pellets around crowns; re‑apply after heavy rain.",
    "Biological: nematodes when soil 5–12°C (often April–September); re‑treat 6 weeks later."
  ],
  "spacing_depth_quick_guide": [
    "General rule: sow seeds at ≈2–3× seed thickness (fine seed often surface or 0.5cm).",
    "Thinnings: carrots/radish 2–4cm; beetroot 8–10cm; lettuce 20–25cm; kale/cabbage 40–60cm in large planters.",
    "Container depth: roots (carrot/parsnip) 30–40cm deep; potatoes 35–45L bags; tomatoes 10–15L minimum."
  ],
  "seed_starting": [
    "Start tender crops (tomato, chilli, cucumber) indoors Feb–Apr with a propagator or warm windowsill (18–22°C).",
    "Provide bright light to avoid legginess; use a clip‑on LED if windows are dull.",
    "Prick out to modules once first true leaves appear; pot on before roots circle."
  ],
  "planting_on": [
    "Harden off 7–10 days before outside: gradually increase outdoor time, avoid cold winds.",
    "Transplant on a still, mild day; water in with seaweed solution to reduce shock."
  ],
  "season_extension_calendar": [
    "Jan–Mar: sow hardy leaves under fleece/cold frame; chit potatoes late Feb (earlies).",
    "Apr–May: cloche/mesh for brassicas; set out hardy herbs; keep tender crops inside if nights <8°C.",
    "Jun–Aug: ventilate covers daily; shade greenhouse in heat spikes; mulch and feed fruiting pots.",
    "Sep–Nov: plant garlic; sow overwintering salads; add fleece on cold nights.",
    "Dec: tidy, mulch perennials; service tools; plan rotations for containers."
  ],
  "hygiene_rotation": [
    "Rotate families in pots if reusing mix: brassicas ➜ legumes ➜ roots/others ➜ fruiting.",
    "Disinfect trays/tools each season; remove yellowing leaves promptly to reduce disease pressure."
  ],
  "accessibility_cost_savers": [
    "Cardboard cylinders/folded boxes as biodegradable starter pots; remove bases at planting.",
    "Use free pallets to build waist‑high planters (line with damp‑proof membrane + drainage holes).",
    "Make pot feet from wine cork stacks or bricks to lift containers off wet ground."
  ]
}