{
  "region": "Scotland",
  "pestwatch": {
    "0": {
      "title": "Pest Watch – January (Scotland)",
      "items": [
        "Check overwintered brassicas for pigeons – use netting or fleece.",
        "Botrytis (grey mould) in damp cold frames – ventilate on dry days.",
        "Slugs hiding under pots and debris – clear regularly."
      ]
    },
    "1": {
      "title": "Pest Watch – February (Scotland)",
      "items": [
        "Aphids can appear on early sowings during mild spells.",
        "Slugs damaging salad leaves under cloches.",
        "Mice eating pea and bean seeds stored in sheds or trays."
      ]
    },
    "2": {
      "title": "Pest Watch – March (Scotland)",
      "items": [
        "Flea beetle attacking brassica seedlings – protect with fleece.",
        "Slugs and snails emerging strongly as temperatures rise.",
        "Damping-off fungus in crowded seed trays – improve airflow and avoid overwatering."
      ]
    },
    "3": {
      "title": "Pest Watch – April (Scotland)",
      "items": [
        "Cabbage root fly – protect brassicas with collars.",
        "Carrot fly becomes active – use fine netting or fleece barriers.",
        "Slugs active on seedlings – set traps and hand-pick at dusk."
      ]
    },
    "4": {
      "title": "Pest Watch – May (Scotland)",
      "items": [
        "Aphids colonising beans and brassicas – encourage ladybirds.",
        "Cabbage white butterflies laying eggs on brassicas – check undersides of leaves.",
        "Blackfly on broad beans – pinch out infested shoot tips."
      ]
    },
    "5": {
      "title": "Pest Watch – June (Scotland)",
      "items": [
        "Potato blight risk rises in warm, damp weather – remove affected leaves promptly.",
        "Pea moth caterpillars – use insect mesh over crops.",
        "Whitefly on greenhouse tomatoes and cucumbers – use sticky traps and ventilation."
      ]
    },
    "6": {
      "title": "Pest Watch – July (Scotland)",
      "items": [
        "Powdery mildew on courgettes – water at soil level and remove infected leaves.",
        "Tomato blight spreads in wet conditions – maintain good airflow.",
        "Cabbage white caterpillars – hand-pick or use mesh netting."
      ]
    },
    "7": {
      "title": "Pest Watch – August (Scotland)",
      "items": [
        "Blight peak risk for potatoes and tomatoes – harvest early if needed.",
        "Onion white rot risk – rotate crops and avoid replanting in same soil.",
        "Fruit flies around soft fruit – harvest promptly, avoid fallen fruit."
      ]
    },
    "8": {
      "title": "Pest Watch – September (Scotland)",
      "items": [
        "Slugs thrive in damp conditions – use beer traps or copper barriers.",
        "Grey mould on autumn salads – increase ventilation.",
        "Rodents raiding stored crops – secure storage areas."
      ]
    },
    "9": {
      "title": "Pest Watch – October (Scotland)",
      "items": [
        "Clubroot risk on brassicas – lime soil to reduce acidity.",
        "Moulds in damp polytunnels – ventilate regularly.",
        "Rodents near compost heaps – deter with secure bins."
      ]
    },
    "10": {
      "title": "Pest Watch – November (Scotland)",
      "items": [
        "Slug damage under cloches – clear hiding spots and set traps.",
        "Yellowing brassica leaves encourage pests – remove promptly.",
        "Cover leafy veg from pigeons as food sources decline."
      ]
    },
    "11": {
      "title": "Pest Watch – December (Scotland)",
      "items": [
        "Protect stored root crops (carrots, potatoes) from mice and rats.",
        "Ventilate greenhouses on mild days to prevent fungal growth.",
        "Weed around overwintering garlic and onions to reduce pest harbourage."
      ]
    }
  }
}