{
  "region": "Ireland",
  "pestwatch": {
    "0": {
      "title": "Pest Watch – January (Ireland)",
      "items": [
        "Pigeons on overwintered brassicas – use netting.",
        "Grey mould (botrytis) in damp frames – ventilate on dry days.",
        "Slugs under pot rims and stones – hand-pick after rain."
      ]
    },
    "1": {
      "title": "Pest Watch – February (Ireland)",
      "items": [
        "Aphids on early broad beans in mild spells.",
        "Mice taking pea/bean seeds in sheds – use secure containers.",
        "Slugs on salad leaves under cloches."
      ]
    },
    "2": {
      "title": "Pest Watch – March (Ireland)",
      "items": [
        "Flea beetle nibble on brassica seedlings – use fine mesh.",
        "Damping-off in seed trays – improve airflow, avoid overwatering.",
        "Snails emerging strongly – set beer traps."
      ]
    },
    "3": {
      "title": "Pest Watch – April (Ireland)",
      "items": [
        "Carrot fly – cover with insect mesh immediately after sowing.",
        "Cabbage root fly – use collars on seedlings.",
        "Slugs on potatoes and courgettes when planting out."
      ]
    },
    "4": {
      "title": "Pest Watch – May (Ireland)",
      "items": [
        "Aphids/blackfly on beans – pinch out infested tips.",
        "Cabbage white butterflies laying on brassicas – check undersides of leaves.",
        "Cutworm and leatherjackets in pots – disturb soil, encourage birds."
      ]
    },
    "5": {
      "title": "Pest Watch – June (Ireland)",
      "items": [
        "Potato blight risk rising in humid weather – water at soil, remove affected foliage early.",
        "Whitefly in greenhouses – use sticky cards and ventilation.",
        "Pea moth caterpillars – fine mesh if a known local issue."
      ]
    },
    "6": {
      "title": "Pest Watch – July (Ireland)",
      "items": [
        "Tomato late blight risk in warm, wet spells – prune for airflow, avoid leaf wetting.",
        "Powdery mildew on courgettes – water roots, remove worst leaves.",
        "Cabbage white caterpillars – hand-pick, keep mesh on."
      ]
    },
    "7": {
      "title": "Pest Watch – August (Ireland)",
      "items": [
        "Blight peak season – potatoes and tomatoes especially at risk.",
        "Onion white rot – avoid replanting alliums in affected compost.",
        "Fruit flies around soft fruit – harvest promptly, remove windfalls."
      ]
    },
    "8": {
      "title": "Pest Watch – September (Ireland)",
      "items": [
        "Slugs after frequent rain – refresh barriers and traps.",
        "Grey mould on salads – increase spacing/airflow.",
        "Rodents raiding stored potatoes – use rodent-proof bins."
      ]
    },
    "9": {
      "title": "Pest Watch – October (Ireland)",
      "items": [
        "Clubroot on brassicas in damp soils – lime new beds/containers if needed.",
        "Mildews in polytunnels – ventilate daily.",
        "Vine weevil in container compost – inspect when repotting."
      ]
    },
    "10": {
      "title": "Pest Watch – November (Ireland)",
      "items": [
        "Pigeons on winter brassicas – fit netting or bird lines.",
        "Slugs under cloches – set traps, reduce hiding spots.",
        "Grey mould on late tomatoes/peppers – clear spent plants."
      ]
    },
    "11": {
      "title": "Pest Watch – December (Ireland)",
      "items": [
        "Mice on stored roots – check hessian/boxes weekly.",
        "Ventilate greenhouses on dry days to reduce mould pressure.",
        "Weed around garlic/clove plantings to reduce pest cover."
      ]
    }
  }
}